{"start time": "2019-12-04 23:18:51.140392", "row_count": 35060, "dataset_name": "8vv7-7wx3.tsv.gz", "columns": [{"column_name": "Record ID", "number_non_empty_cells": 35059, "number_empty_cells": 1, "number_distinct_values": 24831, "frequent_values": ["List of Advisories", "The National Weather Service has issued the following:", "Rainfall at three NOAA rain gauges over the past 24 hours in inches:", "A CSO Waterbody Advisory has been issued. For more info on affected waterbodies, call 311 or go to http://on.nyc.gov/JJmJoK\"", "If you are affected by the outage, turn off all appliances, avoid downed and hanging power lines, and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you are having a life threatening medical emergency and need immediate assistance, please dial 9-1-1.\""], "dataTypes": [{"type": "Integer", "count": 14536, "max_val": 14628, "min_val": 1, "mean": 7290.48197578426, "std_dev": 4221.750776197545}, {"type": "Text", "count": 20523, "longest_values": ["The National Weather Service has issued a High Wind Warning for New York City in effect from 1/23 at 1:00 AM until 1/24 at 1:00 AM. The warning has been issued for sustained winds of 30 to 40 mph and gusts in excess of 60 mph. During periods of high winds, residents should use caution when walking or driving profile vehicles. Winds at these speeds can cause flying debris, turn unsecured objects into projectiles, and cause power outages. To prepare, charge cell phone batteries, gather supplies, and turn refrigerators and freezers to a colder setting. Always stay clear of downed power lines. If you are affected by an outage, turn off all appliances and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you lose power and have a disability or access needs, or use Life Sustaining Equipment (LSE) and need im\"", "List of Advisories: BERGEN BASIN: CSO Advisory until 6/14/2012 7:00AM BRONX RIVER: CSO Advisory until 6/13/2012 5:00PM FLUSHING BAY: CSO Advisory until 6/14/2012 5:00AM FLUSHING CREEK: CSO Advisory until 6/14/2012 5:00PM FRESH CREEK: CSO Advisory until 6/14/2012 7:00AM GOWANUS CANAL: CSO Advisory until 6/15/2012 4:00AM HEAD OF BAY: CSO Advisory until 6/14/2012 7:00AM HUTCHINSON RIVER: CSO Advisory until 6/13/2012 5:00PM NEWTOWN CREEK: CSO Advisory until 6/15/2012 5:00AM NORTHERN JAMAICA BAY: CSO Advisory until 6/13/2012 7:00PM PAERDEGAT BASIN: CSO Advisory until 6/15/2012 7:00AM SHEEPSHEAD BAY: CSO Advisory until 6/13/2012 7:00PM SHELLBANK BASIN: CSO Advisory until 6/13/2012 7:00PM SPRING CREEK: CSO Advisory until 6/13/2012 7:00PM THURSTON BASIN: CSO Advisory until 6/14/2012 7:00PM WESTCHESTER CREEK: CSO Advisory until 6/14/2012 5:00AM ", "An advisory is issued for sustained winds of 20 mph to 30 mph and gusts up to 50 mph are expected. A watch is issued when sustained winds of 25-40 MPH and gusts up to 60 MPH are expected. During periods of high winds, residents should use caution when walking or driving high profile vehicles. Winds at these speeds can cause flying debris, turn unsecured objects into projectiles, and cause power outages. To prepare, charge cell phone batteries, gather supplies, and turn refrigerators and freezers to a colder setting. Always stay clear of downed power lines. If you are affected by an outage, turn off all appliances and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you lose power and have a disability or access needs, or use\"", "New Yorkers are encouraged to stay indoors as much as possible. When outdoors, be sure to wear dry, warm clothing and cover exposed skin. Check on your neighbors, friends, and relatives, especially the elderly and those with disabilities, and access and functional needs during periods of extreme cold. People most likely to be exposed to dangerous cold include those who lack shelter, work outdoors and/or live in homes with malfunctioning or inadequate heat. Seniors, infants, people with chronic cardiovascular or lung conditions, people using alcohol or drugs, and people with cognitive impairments (like dementia, serious mental illness or developmental disability) are at increased risk.", "List of Advisories: BERGEN BASIN: CSO Advisory until 6/03/2012 3:00AM BRONX RIVER: CSO Advisory until 6/02/2012 5:00PM FLUSHING BAY: CSO Advisory until 6/02/2012 5:00PM FLUSHING CREEK: CSO Advisory until 6/02/2012 5:00PM FRESH CREEK: CSO Advisory until 6/03/2012 3:00AM GOWANUS CANAL: CSO Advisory until 6/04/2012 5:00AM HEAD OF BAY: CSO Advisory until 6/02/2012 3:00PM HUTCHINSON RIVER: CSO Advisory until 6/02/2012 5:00PM NEWTOWN CREEK: CSO Advisory until 6/03/2012 5:00PM PAERDEGAT BASIN: CSO Advisory until 6/04/2012 3:00AM SHEEPSHEAD BAY: CSO Advisory until 6/02/2012 3:00PM THURSTON BASIN: CSO Advisory until 6/03/2012 3:00PM WESTCHESTER CREEK: CSO Advisory until 6/03/2012 5:00AM"], "shortest_values": ["\u001a", "\"", "-", "o", ".\""], "average_length": 75.11874482288164}, {"type": "Date/Time", "count": 1, "max_value": "2001-09-01 00:00:00", "min_value": "2001-09-01 00:00:00"}]}, {"column_name": "Date and Time", "number_non_empty_cells": 15677, "number_empty_cells": 19383, "number_distinct_values": 14347, "frequent_values": ["None", "0 inches ", "0 inches", "03/13/2010 12:00:00 AM", "0.03 inches "], "dataTypes": [{"type": "Text", "count": 20525, "longest_values": ["Coastal Flood Watch for BK, SI, & south QN from 8AM-12PM on 3/14. Tides 2-3 feet above normal are possible for the south shore bays of Long Island and the lower New York Harbor. During a Coastal Flood Watch, minor flooding of the most vulnerable shore roads and/or adjacent properties is possible due to the height of the storm tide, wave splash-over, and/or ef\"", "Metro-North will resume limited hourly service starting at 6PM tonight until 11PM on the Hudson, Harlem, and New Haven lines. There will be no branch service. Full Metro-North service will resume tomorrow morning, 3/15, per the regular weekday schedule.", "NYC Transit, LIRR and Metro North commuters are encouraged to stay home tomorrow if possible as additional service changes are expected. Customers are encouraged to regularly check www.mta.info for service updates affecting the Tuesday morning commute.", "MTA above-ground subway service will be suspended citywide beginning at 4:00 AM tomorrow, 3/14. For more details, please view the MTA below-ground-only service map here: http://bit.ly/2mFjv3E.", "Coastal Flood Advisory in effect for Brooklyn, Manhattan, and southern Queens from 3PM-9PM on 1/23. Tidal departures of 3.5-4.5 feet above normal are expected."], "shortest_values": ["* ", "None", "0 inches", "1 inches", "On advi\""], "average_length": 5.197515225334957}, {"type": "Date/Time", "count": 14535, "max_value": "2019-09-27 15:00:00", "min_value": "1900-01-01 00:00:00"}]}, {"column_name": "NotificationType", "number_non_empty_cells": 14543, "number_empty_cells": 20517, "number_distinct_values": 26, "frequent_values": ["None", "Road Closure", "Mass Transit Disruption", "Missing Adult", "Utility"], "dataTypes": [{"type": "Text", "count": 35060, "longest_values": ["Missing Child / Adolescent", "Mass Transit Restoration", "Mass Transit Disruption", " (Coney Island, BK)", "School Notification"], "shortest_values": ["Fire", "None", " (MN)", " (SI)", "Parking"], "average_length": 8.074044495151169}]}, {"column_name": "Notification Title", "number_non_empty_cells": 14535, "number_empty_cells": 20525, "number_distinct_values": 10239, "frequent_values": ["None", "[blank]", "CSO Advisory (CW)", "CSO Advisory - (Citywide)", "CSO Advisories (CW)"], "dataTypes": [{"type": "Text", "count": 35060, "longest_values": ["Joint Emergency Response Drill - Lenox Hill HealthPlex and NewYork-Presbyterian/Lower Manhattan Hospital (MN) - 5/23", "Mayor's Fund to Advance NYC Accepting Contributions for Those Affected by 3/12 East Harlem Building Collapse (CW)", "70th Anniversary of D-Day: Helicopter Flyover, Rose Petal Release, and 21-Gun Salute - 6/6/14 (BK, MN, SI)", "US Small Business Administration Disaster Loan Outreach Center - East Village Building Collapse (MN)", "Fleet Week 2014 - Parade of Sails & U.S. Marine Corps (USMC) Familiarization Flights - 5/21/14 (CW)"], "shortest_values": ["None", "Blank", "[blank]", "1 WTC Fire", "LIE Delays"], "average_length": 18.081774101540216}]}, {"column_name": "Email Body", "number_non_empty_cells": 14121, "number_empty_cells": 20939, "number_distinct_values": 14043, "frequent_values": ["None", "Rainfall at DEP rain gauges over the past 24 hours in inches: ", "Rainfall at three NOAA rain gauges over the past 24 hours in inches:", "The National Weather Service has issued the following:", "Notification issued 03-21-2019 at 5:20 PM. "], "dataTypes": [{"type": "Text", "count": 35058, "longest_values": ["Notification issued 10/02/15 at 12:55 PM. New York City is forecast to experience intermittent wind gusts in excess of 40 MPH. During periods of high winds, residents should use caution when walking or driving high profile vehicles. Winds at these speeds can cause flying debris, turn unsecured objects into projectiles, and cause power outages. Individuals who have constructed a Succah for the holiday should take appropriate actions to secure the structure and roofing to prevent damage or injury from flying debris. To prepare, charge cell phone batteries, gather supplies, and turn refrigerators and freezers to a colder setting. Always stay clear of downed power lines. If you are affected by an outage, turn off all appliances and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you lose power and have a disability or access needs, or use Life Sustaining Equipment (LSE) and need immediate assistance, please dial 9-1-1. For the latest weather information visit", "Notification issued 11/19/16 at 3:34 PM. The National Weather Service has issued a Wind Advisory citywide in effect for Sunday, November 20 at 6:00am to Monday, November 21 at 6:00pm. The advisory has been issued for sustained winds of 25 mph to 35 mph and gusts in excess of 50 mph. During periods of high winds, residents should use caution when walking or driving high profile vehicles. Winds at these speeds can cause flying debris, turn unsecured objects into projectiles, and cause power outages. To prepare, charge cell phone batteries, gather supplies, and turn refrigerators and freezers to a colder setting. Always stay clear of downed power lines. If you are affected by an outage, turn off all appliances and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you lose power and have a disability or access needs, or use Life Sustaining Equipment (LSE) and need immediate assistance, please dial 9-1-1. For the latest weather information visit www.weather.gov/", "Notification issued 9/3/16 at 8:22 PM. The National Weather Service has issued a Tropical Storm Warning and Storm Surge Watch for New York City until further notice. New Yorkers should take actions ahead of the storm to prepare for high winds, minor-to-moderate coastal flooding, rain, life-threatening rip tides, and high surf. The National Weather Service is currently forecasting sustained winds of 35-45 mph with the potential for gusts up to 60 mph for the NYC area beginning as early as Sunday, and possibly extending through Tuesday evening. High winds can bring down trees and power lines and can turn unsecured objects into dangerous projectiles. When winds reach tropical storm levels, NYC area bridges may implement speed and vehicle restrictions. New Yorkers should expect potential restrictions Sunday evening through Tuesday. Due to life-threatening rip tides, NYC beaches are closed to swimming, surfing, and bathing on Sunday, September 4, 2016. Prepare for flooding: If you live in a flood-susceptible area,", "Notification issued 9/4/16 at 7:00 PM. The National Weather Service has issued a Tropical Storm Warning for New York City until further notice. New Yorkers should take actions ahead of the storm to prepare for high winds, minor-to-moderate coastal flooding, rain, life-threatening rip tides, and high surf.  The National Weather Service is currently forecasting sustained winds of 20-30 mph with the potential for gusts up to 50 mph for the NYC area beginning as early as Sunday, and possibly extending through Tuesday evening. High winds can bring down trees and power lines and can turn unsecured objects into dangerous projectiles. When winds reach tropical storm levels, NYC area bridges may implement speed and vehicle restrictions. New Yorkers should expect potential restrictions Sunday evening through Tuesday. Due to life-threatening rip tides, NYC beaches are closed to swimming, surfing, and bathing on Monday, September 5, 2016. Prepare for flooding: If you live in a flood-susceptible area, keep sandbags, plywo", "Previous 24-hour rainfall (inches) at NOAA rain gauges as of 2/12/13 7:00AM: Rainfall at three NOAA rain gauges over the past 24 hours in inches:                                    JFK Airport:    0.39                        LaGuardia Airport: 0.52                        Central Park:   0.4                                                           List of Advisories                                                             BERGEN BASIN: CSO Advisory until 2/12/2013 7:00 PM          BRONX RIVER: No CSO Advisory                     FLUSHING BAY: No CSO Advisory                     FLUSHING CREEK: CSO Advisory until 2/12/2013 11:00 AM         FRESH CREEK: No CSO Advisory                     GOWANUS CANAL: CSO Advisory until 2/13/2013 12:00 AM         HEAD OF BAY: No CSO Advisory                     HUTCHINSON RIVER: No CSO Advisory                   MILL BASIN: No CSO Advisory                      NEWTOWN CREEK: CSO Advisory until 2/12/2013 11:00 PM         NORTHERN JAMAICA BAY: No CSO Advisory                "], "shortest_values": ["None", "Nixle Messages:", "Nixle: 4th of July", "DOHMH Spraying (SI)", "Nixle Messages 7/9:"], "average_length": 107.93693308232072}, {"type": "Date/Time", "count": 2, "max_value": "2015-06-28 07:15:00", "min_value": "2010-08-25 16:20:00"}]}], "col_count": 6, "key_column_candidates": ["Record ID"], "end time": "2019-12-04 23:19:10.097820"}