{"start time": "2019-12-05 01:35:50.515647", "row_count": 71, "dataset_name": "bgb4-7zjj.tsv.gz", "columns": [{"column_name": "Agency Name", "number_non_empty_cells": 71, "number_empty_cells": 0, "number_distinct_values": 14, "frequent_values": ["Department of Transportation (DOT)", "Department of Parks and Recreation (DPR)", "Department for the Aging (DFTA)", "Department of Finance (DOF)", "Department of Youth and Community Development (DYCD)"], "dataTypes": [{"type": "Text", "count": 71, "longest_values": ["The summonses provided in this dataset are issued and filed at the OATH Hearings Division by City enforcement agencies, including the NYPD. For the NYPD to post their own dataset would be duplicative and potentially confusing. (2018 NYC Open Data Plan)\"", "https://data.cityofnewyork.us/City-Government/OATH-Hearings-Division-Case-Status/jz4z-kudi/data", "Department of Housing Preservation and Development (HPD)", "Department of Youth and Community Development (DYCD)", "Mayor's Office of Environmental Remediation (MOER)"], "shortest_values": [" (For Construction)\"", "Police Department (NYPD)", "Department of Finance (DOF)", "Mayor’s Office of Resiliency", "Department of Education (DOE)"], "average_length": 39.436619718309856}]}, {"column_name": "Data Set Title", "number_non_empty_cells": 69, "number_empty_cells": 2, "number_distinct_values": 69, "frequent_values": ["Sea Level Rise Maps (2025s Mean Monthly High Water)", "None", "DFTA_OmbudsmanContracts_Budgets", "DFTA_OmbudsmanContracts_Info", "DFTA_OmbudsmanContracts_ReportedExp"], "dataTypes": [{"type": "Text", "count": 71, "longest_values": ["Amount of work inspected per workorder sent to the contractor. Has billing info of contractor. (Life of pavement markings from inspection to payment)", "Sea Level Rise Maps (2020s Mean Monthly High Water)", "Sea Level Rise Maps (2025s Mean Monthly High Water)", "Demographic Statistics By Congressional District", "Map of NYC Parks Maintenance Region Boundaries"], "shortest_values": ["None", "GangMenu", "OATH Summons", "Bicycle Shops", "CMVT - Annual"], "average_length": 30.35211267605634}]}, {"column_name": "Data Set Description", "number_non_empty_cells": 68, "number_empty_cells": 3, "number_distinct_values": 66, "frequent_values": ["None", "TBD", "Approved DOT Accessible Pedestrian Signal Invoices with work orders by location for the three phases of work (dig, wire and restore) and includes material proof of purchase. The dataset is stored in Excel spreadsheets and updated with each Invoice that is submitted.", "2025s Mean Monthly High Water + 30” Sea Level Rise.", "Summary of DFTA Ombudsman Contracts Bottom Line Budgets"], "dataTypes": [{"type": "Text", "count": 71, "longest_values": ["DOT Art collaborates with volunteer organizations to beautify concrete barriers with bold, colorful murals that are designed by professional artists but painted almost entirely by volunteers. Barriers located along protected bike lanes or active sidewalks serve as canvases for art. DOT Art provides selected artists with a design honorarium of $2,500 and a materials fee of $500 for stencil production. DOT Art provides paint and associated materials at no cost to the artist, and coordinates volunteer recruitment and secures volunteers to implement the mural on a single day in fall and spring. Murals remain installed for 11 months.", "In collaboration with the NYC Department of Cultural Affairs (DCLA) Percent for Art Program, DOT commissions permanent art as part of the Percent for Art ordinance. DOT designates facilities such as: bridges, sidewalks, ferries, medians, plazas, etc. for permanent art as part of DOT capital construction projects. Project-specific selection panels review artists to develop proposals in collaboration with the project design team. DOT selects new sites each year and determines eligibility for permanent artwork. For more information on the DCLA Percent for Art Program, visit: www.nyc.gov/culture.", "DOT Art commissions temporary artwork in conjunction with a priority agency initiative up to twice a year. Selected artists are eligible to receive up to $20,000 towards direct project costs. Artists should visit the Program Tracks and Opportunities page on a consistent basis to learn of upcoming open calls or sign up for the e-newsletter. Examples of past projects outside of the four Program Tracks include: Asphalt Art Activations, Summer Streets Interventions, and Construction Fence Banner Wraps.", "Signaling devices positioned at road intersections, pedestrian crossings, and other locations to control flows (progressions and simultaneous traffic control) of traffic and the right-of-way for vehicles arriving at an intersection, which can reduce traffic delay and accident-producing conflicts. It also makes an intersection safe by determining whether vehicles or pedestrians should proceed.", "Emergency Snow Reporting application allows Office of Emergency Response (OER) to support snow tracking/reporting process by automating coordination across DOT divisions, while providing standard data input templates, scheduled electronic reports for each snow event and a searchable report repository."], "shortest_values": ["TBD", "None", "To Be Determined", "Map of NYC Parks Paths", "Map of NYC Parks Monuments"], "average_length": 108.77464788732394}]}, {"column_name": "Update Frequency", "number_non_empty_cells": 68, "number_empty_cells": 3, "number_distinct_values": 10, "frequent_values": ["To Be Determined", "Quarterly", "Annually", "Weekly", "Monthly"], "dataTypes": [{"type": "Text", "count": 70, "longest_values": ["To Be Determined", "To be determined", "Semi-Annually", "As needed", "Quarterly"], "shortest_values": ["None", "Weekly", "Monthly", "Annually", "As needed"], "average_length": 11.457142857142857}, {"type": "Date/Time", "count": 1, "max_value": "2019-12-31 00:00:00", "min_value": "2019-12-31 00:00:00"}]}, {"column_name": "Release Date", "number_non_empty_cells": 68, "number_empty_cells": 3, "number_distinct_values": 15, "frequent_values": ["12/31/2019", "04/15/2019", "12/31/2018", "07/31/2019", "06/30/2019"], "dataTypes": [{"type": "Text", "count": 4, "longest_values": ["Not Public Data- Internal Administration", "None"], "shortest_values": ["None", "Not Public Data- Internal Administration"], "average_length": 13.0}, {"type": "Date/Time", "count": 67, "max_value": "2019-12-31 00:00:00", "min_value": "2018-09-30 00:00:00"}]}, {"column_name": "Agency Comment", "number_non_empty_cells": 67, "number_empty_cells": 4, "number_distinct_values": 39, "frequent_values": ["Not Public Data- Internal Administration", "New York City Department for the Aging does not have a contract with the Office of the Ombudsman for the last 2 years and there is no data to post on the Open Data.", "This incomplete dataset is not currently maintained, and, therefore, does not qualify as Open Data.", "None", "Available through Temporary Arts"], "dataTypes": [{"type": "Text", "count": 71, "longest_values": ["This data is used solely for internal tracking purposes, as a way to determine whether, during a Code Red or Code Blue weather event, agency employees have visited properties under the agency’s jurisdiction to offer homeless individuals the appropriate services. This data, which is of poor quality to begin with, is intended only for internal deliberative, pre-decisional use by agency executive staff in relation to staffing and utilization decisions. It is not data used in the furtherance of the agency’s mission, but rather for internal agency administration.", "At this time, the Cigarette Tax Enforcement Data cannot  be provided in a useful way that can be published on the Open Data portal. The data components are currently stored across different platforms which is  determined by the enforcement actions. A new application for handling Cigarette Tax data  has been approved and should be in place by next year, so until that time, the data will not be available in a manner suitable for public consumption (2018 NYC Open Data Plan).", "This data is used solely for internal tracking purposes, as a way to determine whether ice ladders are present at lakes and ponds under the agency’s jurisdiction. This data, which is of poor quality to begin with, is intended only for internal deliberative, pre-decisional use by agency executive staff in relation to equipment. It is not data used in the furtherance of the agency’s mission, but rather for internal agency administration.", "The Department of Finance (DOF) cannot provide the Commercial Motor Vehicle Tax dataset because this data is tax secret pursuant to §§11-818 of the NYC Admin Code and thus prohibited from disclosure. Anonymized data also cannot be disclosed because all data derived from the CMVT returns is prohibited from release. Please remove this dataset from DOF’s compliance plan for 2018.", "Parks is in the process of replacing this database. A large portion of this database is private information about recreation center members. Parks will evaluate the feasibility of voluntarily publishing an aggregate dataset about recreation center membership, protecting this private information, once a new database is in place."], "shortest_values": ["None", "duplicate plan entry", "Data is currently unavailable", "Available through Temporary Arts", "Not Public Data- Not tabular data"], "average_length": 122.07042253521126}]}], "col_count": 7, "key_column_candidates": ["Data Set Title"], "end time": "2019-12-05 01:35:51.207137"}