{"start time": "2019-12-05 04:18:16.430076", "row_count": 600, "dataset_name": "g9ub-hrve.tsv.gz", "columns": [{"column_name": "Project ID", "number_non_empty_cells": 599, "number_empty_cells": 1, "number_distinct_values": 588, "frequent_values": ["•", "Scope:", "PW29370M", "PV205ACAD", "F175EC293A"], "dataTypes": [{"type": "Text", "count": 600, "longest_values": ["Demolition of existing fendering system, site structures and equipment. Dredging at barge pier, adjacent to new marine transfer station (MTS). Construction of new underground utility system and new MTS foundations. Construction of new marine transfer station. Construction and installation of new container gantry crane system, new roadways and parking areas. Construction of new bulkhead walls and property line fence. Final grading and landscaping of land surrounding the new construction. Furnishing, installing, testing, and placing into operation complete HVAC, plumbing, fire protection pumping, & electrical systems.\"", "The scope of this project is to implement a building-wide energy efficiency retrofit of the Bellevue Men’s Shelter, located at 400 East 30th Street in New York, NY 10016.  The energy conservation measures (ECMs) to be designed, installed, and commissioned comprise improvements of the electrical system and HVAC system, along with the installation of energy meters and data-gathering equipment to ensure the correct operation of the other improvements.  These ECMs will increase the fitness of energy-consuming equipment systems by improving energy performance and allowing for more efficient building operation.\"", "Culture Shed Inc. is responsible for reimbursing Related Properties for the core and shell construction of the portions of Tower D and the Podium occupied by the Culture Shed facility (foundations, floor and roof structure, slabs,roofing, waterproofing, and curtainwall).  Culture Shed Inc. is responsible for construction and payment for the fit-out of these spaces (interior partitions, finishes, vertical transporation, glazing, etc.) by its own construction manager.  Phase 3 is part of the overall Culture Shed facility, but is not included in “The Project” that is the subject of this CCG application.\"", "Portions of the Culture Shed facility, primarily lobbies, restrooms, coffee bar, bookstore, back offices, catering kitchen, loading and service facilities, and mechanical rooms will also be located in the Podium.  The Podium is defined as the area below plaza level, below the Culture Shed Building and the Plaza,that is to be developed by Related Properties.  The portions of the Culture Shed facility within the Podium are easily accessible from the Culture Shed Building above via stairs and elevators.  ", "New 4.16kV medium voltage Con-Edison Service able to accommodate the existing, new and projected loads. New 4.16kV service distribution configuration in Building “G” located in new or enlarged service switchgear room in this building or above the ground immediately adjacent to building “G”. New service distribution switchgear shall include Con-Edison C/T compartments, metering & 4.16kV/ 180-208V step-down transformers.  The above mentioned new service shall be able to accommodate the electric loads.\""], "shortest_values": ["o", "•", "None", "HVAC:", "MOCDV"], "average_length": 49.166666666666664}]}, {"column_name": "Description", "number_non_empty_cells": 431, "number_empty_cells": 169, "number_distinct_values": 361, "frequent_values": ["None", "5M+", "1M-5M", "0-500k", "501k-1M"], "dataTypes": [{"type": "Text", "count": 572, "longest_values": ["Phase 2:  The Shed and the Plaza:  The Shed is a 125 foot tall movable structure comprised of 3 sides (north, east,south) and a roof. Its western side is open and is filled by the eastern face of the Culture Shed Building to which it is connected.  In the nested position, the Shed covers the Culture Shed Building (north, east, south, overhead).  In the deployed position, the Shed no longer covers the Culture Shed Building, but is still connected to it at the fixed building’s easternmost façade.   The Plaza is an 18,000 square foot open space directly east of the Culture Shed Building.  When deployed, the Shed covers the Plaza creating a large, tall, and flexible space for a multitude of programming.   When the Shed is not deployed (ie it is nested over the Culture Shed Building), the Plaza will be completely open-air and used for a variety of cultural activities that will be open to the public.  Phase 2 is part of the overall Culture Shed facility, but is not included in “The Project” that is the subject of this CCG application.", "Phase 1:  The Culture Shed Building:  This portion of the facility is referred to as the “fixed building”.  It is an 84,733 square foot, 107 foot tall, seven story structure containing museum-quality exhibition and performance galleries, a café, a roof gallery, circulation, and support spaces. It features expansive column-free floor plates that are suitable for the presentation of exhibitions and a wide range of performance productions and will include all the essential operating infrastructure to produce visual art exhibits, performances, and events.  The Culture Shed will only initiate Phase 1 in concert with the building of the Tower D core and shell where the mechanical, electrical, plumbing, and life safety systems that serve the fixed building reside.  These systems are included in the Phase 1 scope. Phase 1 is “The Project” that is the subject of this CCG application.  Anticipated construction completion date is Oct 16, 2019", "Phase 3:  Portions of Culture Shed in Tower D and the Podium:  Portions of the Culture Shed facility, primarily back office, service facilities, and mechanical rooms will be located in the residential building currently known as Tower D to be developed by the Eastern Rail Yard (ERY) Developer, Related Properties. Tower D is located on the east side of Eleventh Avenue between West 30th and West 31st Streets, immediately west of and adjacent to the Culture Shed Building.  The portions of the Culture Shed facility within Tower D are easily accessible from the Culture Shed Building as they are co-level, adjacent, and separated only by a structural construction joint.  ", "This part of the project includes upgrading the Delivery Entrance, which is increasingly used for off-hour public & staff access, to ADA standards. Gravel makes the ground unsteady for seniors, people with disabilities and difficult for delivery people bringing heavy loads. Due to poor drainage and icing over in cold months, this area becomes very dangerous. In addition, it is difficult to service the refurbished east well as there is not a gate with direct access. Access/security issues in the eastern portion will be solved using existing, approved designs.\"", "This part of the project will connect the landscape water needs of the Parking Garden to the new West Well allowing QBG to eliminate the use of potable City water for landscape needs thus bringing resource efficiency. The project will also improve energy efficiency through the upgrade of an electrical cabinet installed over 50 years ago and will improve both energy efficiency and safety through the upgrading of electrical poles. This project will thus bring both water and power efficiencies and create a safer environment for use for a greater number of hours."], "shortest_values": ["5M+", "None", "0-500k", "501k-1M", "flea theater"], "average_length": 32.49125874125874}, {"type": "Date/Time", "count": 28, "max_value": "2019-12-05 00:05:00", "min_value": "2019-12-05 00:05:00"}]}, {"column_name": "Client Agency", "number_non_empty_cells": 421, "number_empty_cells": 179, "number_distinct_values": 21, "frequent_values": ["None", "Active", "DCAS", "Cultural Affairs", "Libraries-NYPL"], "dataTypes": [{"type": "Text", "count": 599, "longest_values": ["Environmental Protection", "Parks & Recreation", "Homeless Services", "Cultural Affairs", "Libraries-NYPL"], "shortest_values": ["-", "5M+", "HPD", "DCAS", "Fire"], "average_length": 8.654424040066777}, {"type": "Date/Time", "count": 1, "max_value": "2019-12-05 00:05:00", "min_value": "2019-12-05 00:05:00"}]}, {"column_name": "Division", "number_non_empty_cells": 349, "number_empty_cells": 251, "number_distinct_values": 3, "frequent_values": ["Public Buildings", "None", "Active"], "dataTypes": [{"type": "Text", "count": 600, "longest_values": ["Public Buildings", "Active", "None"], "shortest_values": ["None", "Active", "Public Buildings"], "average_length": 10.93}]}, {"column_name": "Phase", "number_non_empty_cells": 346, "number_empty_cells": 254, "number_distinct_values": 10, "frequent_values": ["None", "Design", "Construction", "Procurement", "Initiation"], "dataTypes": [{"type": "Text", "count": 600, "longest_values": ["Substantially Completed", "Construction", "Development", "Procurement", "Initiation"], "shortest_values": ["-", "FEP", "None", "Design", "Closeout"], "average_length": 7.001666666666667}]}, {"column_name": "Projected Construction Completion ", "number_non_empty_cells": 320, "number_empty_cells": 280, "number_distinct_values": 244, "frequent_values": ["None", "08/31/2018", "07/15/2019", "09/19/2018", "12/18/2020"], "dataTypes": [{"type": "Text", "count": 280, "longest_values": ["None"], "shortest_values": ["None"], "average_length": 4.0}, {"type": "Date/Time", "count": 320, "max_value": "2026-10-22 00:00:00", "min_value": "2015-12-31 00:00:00"}]}, {"column_name": "Scope", "number_non_empty_cells": 346, "number_empty_cells": 254, "number_distinct_values": 330, "frequent_values": ["None", "The purpose of the project is to have a Code compliant fire alarm system (meet FDNY AND the State OTDA standards) and protect the multiple clients, staff and the general public in the facility.", "Installation of new building wide fire alarm system.", "Roof Replacement", "The purpose of the project is to upgrade the existing fire alarm system. The current system does not comply with Code and has had numerous OTDA violations related to the fire alarm system. The fire alarm system has not been approved by FDNY"], "dataTypes": [{"type": "Text", "count": 600, "longest_values": ["A Condition Assessment Report dated September 4, 2014 and a Rehabilitation Analysis and Recommendations report dated December 8, 2014 were prepared by The Burns Group and Greeley & Hansen. Also DDC issued a Field Inspection Report dated March 3, 2014. All reports should be reviewed and used as a basis to prepare preliminary and final design. The selected consultant shall utilize the structural scheme partially developed in the December 8, 2014 Greeley & Hansen report which is to provide intermediate columns and footings to reduce the span of the existing W36 members currently spanning over 100 feet. The selected consultant will be required to evaluate/analyze structural elements in accordance with the requirements of the latest DNSY Garage Design Standards for the heaviest fully loaded salt spreader trucks. The building is to be rehabilitated including extensive structural work (demolition and replacement of cellar-level slab and entrance ramp slab, demolition, and replacement of first floor slab, adding intermediate columns and footings, etc.). Total replacement of building systems (electrical, fire protection, plumbing, HVAC including building management system) and architectural renovation of the entire building is required. Remedial options /scopes of work and cost estimates shall be submitted to DSNY for review prior to starting design. After first floor slab and ramp demolition, the existing exposed structural steel shall be inspected, evaluated and repaired/reinforced as required.", "The project scope of work includes the necessary reconstruction to stabilize and maintain watertight building envelopes of the existing collection of buildings known as the Hunterfly Houses; work shall include roof and flashing replacement; replacement of drainage components including gutters, leaders and collection boxes; reconstruction and replacement of wood siding and trim; reconstruction of the existing windows and doors, trim, frames, sills and stools; reconstruction of the porches including railing, floor board, fascia and trim replacement; damp proofing of the basements in areas where leaders drain onto to direct the flow of drainage away from the foundations.  In addition upgrades to the security and lighting systems will be implemented.", "Project 2 Scope: Refurbishment of the existing pier buildling including: repair of existing pier structure including pile caps and fendering; construction of new emergency generator, electrical, mechanical, fire pump and fire valve rooms; new exit passageway construction and existing exit passageway refurbishment; re-arrangement and refurbishment of the Operations Building interiors; replacement of fire suppression system throughout the entire pier structure; mechanical, electrical and plumbing system upgrades; refurbishment and painting the existing pier interior steel framing and wall/roof surfaces; recoating the  structure's exterior cladding systems including metal wall and roof  panel system and translucent panel wall cladding system.", "The Bronx Childrens Museum and the New York City Department of Parks and Recreation (NYCDRP) will renovate and fit-out the 11,000 Sq Ft second floor of Building J at the Bronx Terminal Market as the new home of Bronx Childrens Museum (BXCM).  The intent is to create exhibit space, interactive program spaces, creative workshops, and a community room to involve parents and children in learning activities.  All required amenities, structural, and MEP work shall be included in the proposed designs.  The scope also includes exterior and interior signage and lighting.  Any requirement for acoustic separation within the museum space and from the first floor office space shall be considered.  This project shall achieve minimum LEED Silver rating.", "Construction of new garage to serve Staten Island Districts 1 and 3.  Relocate Staten Island District 1 and 3 Garage operations to the newly constructed garage.  The existing building containing the Staten Island 3 Garage and Richmond Borough Repair Shop will be rehabilitated, maintaining and expanding the building's use for the Borough Repair Shop and accommodating District 1 and 3 Garage Vehicular Storage Facility for weather sensitive vehicles.  Develop site facilities including a 2,000 ton capacity salt shed, a free-standing fueling facility, open-air household waste drop-off area, outdoor DSNY truck and personnel parking and a potential new force main sanitary line to connect to the NYC DEP system."], "shortest_values": ["-", "None", "LQOZROOF", "HH112AAFS", "HH115LFAU"], "average_length": 85.35666666666667}]}, {"column_name": "Dollar Amount", "number_non_empty_cells": 271, "number_empty_cells": 329, "number_distinct_values": 5, "frequent_values": ["None", "1M-5M", "5M+", "0-500k", "501k-1M"], "dataTypes": [{"type": "Text", "count": 476, "longest_values": ["501k-1M", "0-500k", "None", "5M+"], "shortest_values": ["5M+", "None", "0-500k", "501k-1M"], "average_length": 4.0021008403361344}, {"type": "Date/Time", "count": 124, "max_value": "2019-12-05 00:05:00", "min_value": "2019-12-05 00:05:00"}]}, {"column_name": "Status", "number_non_empty_cells": 271, "number_empty_cells": 329, "number_distinct_values": 2, "frequent_values": ["None", "Active"], "dataTypes": [{"type": "Text", "count": 600, "longest_values": ["Active", "None"], "shortest_values": ["None", "Active"], "average_length": 4.903333333333333}]}], "col_count": 10, "key_column_candidates": ["Project ID"], "end time": "2019-12-05 04:18:17.643247"}