{"start time": "2019-12-05 23:10:15.740512", "row_count": 210, "dataset_name": "qnuk-aubm.tsv.gz", "columns": [{"column_name": "Agency", "number_non_empty_cells": 210, "number_empty_cells": 0, "number_distinct_values": 61, "frequent_values": ["Department of Probation (DOP)", "Department of Housing Preservation and Development (HPD)", "NYC ACRE", "NYC Independent Budget Office (IBO)", "Department of Parks and Recreation (DPR)"], "dataTypes": [{"type": "Text", "count": 210, "longest_values": ["The PLUTO tax lot data files contain over seventy data fields derived from extracts of mainframe data files maintained by the Department of City Planning (DCP), Department of Finance (DOF), Department of Citywide Administrative Services (DCAS), and from information contained in Landmarks Preservation Commission (LPC) publications and web site.\"", "You can easily retrieve detailed event information with the SeatGeek API--everything from the lat/lon of a venue to the average ticket price for a show. It’s all wrapped up in a clean, well-documented API, with no rate limits and no cost to use.", "Request information about companies such as their industry, location (address, city, state, country, zip code, and/or phone number), web site, and/or the web location for their CSR information.", "You can easily do recurring payments/subscriptions, create coupons, invoices, store customer and card information. For questions or comments, contact: rahul_deshpande@mastercard.com\"", "Retrieve high level, intermediate, and/or detailed sustainability performance information on any of 8,800 companies in 102 countries and 135 different industry groups."], "shortest_values": ["Yelp", "CSNYC", "Parse", "Enigma", "LinkUp"], "average_length": 39.838095238095235}]}, {"column_name": "Dataset", "number_non_empty_cells": 204, "number_empty_cells": 6, "number_distinct_values": 202, "frequent_values": ["None", "Hurricane Storm Surge Depths - NNE Bearing", "As Needed", "As needed", "Placements by Community District (CD)"], "dataTypes": [{"type": "Text", "count": 210, "longest_values": ["New York City’s School-Age and 65 and Over Populations by Borough, 1950 – 2040", "Enigma API | Over 100k federal, state, local & international data sets", "Juvenile Operations - End-of-Year Probationer Count (Calendar Year)", "New York Power Authority Net Generation (MWh) Produced by Facility", "Juvenile Operations - End-of-Year Probationer Count (Fiscal Year)"], "shortest_values": ["YQL", "None", "Parse", "Pools", "eGRID"], "average_length": 29.614285714285714}]}, {"column_name": "Dataset Description", "number_non_empty_cells": 197, "number_empty_cells": 13, "number_distinct_values": 178, "frequent_values": ["Data to solve NYC ACRE's BigIdea", "None", "Unadjusted decennial census data from 1950-2000 and projected figures from 2010-2040: summary table of New York City population numbers and percentage share by Borough, including school-age (5 to 17), 65 and Over, and total population.", "This table contains the number of probationers under supervision on the last day of a calendar year", "This table contains the number of presentence investigations completed by the Department during a calendar year"], "dataTypes": [{"type": "Text", "count": 210, "longest_values": ["This list contains the most recently published active medallion drivers list. This is a list of licensees who are currently authorized to operate NYC TLC licensed Taxicabs. The old data set is no longer being updated but can be accessed from the link given below to access data from 03/07/2013 through 01/04/2014 https://data.cityofnewyork.us/Transportation/Medallion-Drivers-Active/n776-dsqy. A new Change Log containing changes in status from 10/28/2013 onwards can be found at https://data.cityofnewyork.us/Transportation/TLC-MEDALLION-ACTIVE-Historical-Data/sjfe-fppp", "The data set contains information on work orders created through HPD's Emergency Repair Program, Alternative Enforcement Program and Demolition programs and fees assessed against properties by HPD pursuant the Housing Manteca Code.  The work orders are created to conduct emergency repair work when an owner fails to address a hazardous condition pursuant to the requirements of an HPD-issued violation, a Department of Buildings Declaration of Emergency, a Department of Health Commissioner's Order to Abate or an emergency violation issued by another City Agency", "The Lehman College Bronx Information Portal is a map-based open data platform with a focus on all things Bronx. Developed by Lehman College/CUNY with Socrata, the portal brings together Bronx-related open data all in one place.  Data sets include education, health, population, environment and sustainability, among others. Join us to engage students, researchers and communities in connecting the Bronx to enrich teaching, learning and community service initiatives. For questions or comments, contact: ronald.bergmann@lehman.cuny.edu", "Carpoolworld brings people together for ridesharing, using a pioneering search engine that matches individuals based on their trip origins and destinations, anywhere on the planet. The Carpoolworld API gives developers access to the web site's essential functions to create trips, find matches, and contact potential travel partners. The API is developed using the RESTful style. Responses are formatted in XML. For questions or comments, contact: iboulard@carpoolworld.com", "LinkUp only indexes jobs that are found on corporate career websites. Today, our U.S site lists roughly 1,500,000 jobs from over 40,000 company websites. Since we don't allow jobs to be manually posted to LinkUp, and because of the sources we index (real companies), we have the cleanest and highest quality dataset of jobs on the web - no job scams, lead-gen pollution, or fraudulent postings. For questions or comments, contact: bsquibb@linkup.com"], "shortest_values": ["None", "Directory Pools", "Landmark interiors", "Directory of Landfills", "Directory of Play Areas"], "average_length": 117.26666666666667}]}, {"column_name": "Update Frequency", "number_non_empty_cells": 194, "number_empty_cells": 16, "number_distinct_values": 12, "frequent_values": ["As needed", "Annually", "Monthly", "Quarterly", "None"], "dataTypes": [{"type": "Text", "count": 210, "longest_values": ["Historical Data", "Semi-Annually", "Biannually", "As Needed", "As needed"], "shortest_values": ["None", "Daily", "Weekly", "Monthly", "Annually"], "average_length": 8.061904761904762}]}], "col_count": 5, "key_column_candidates": ["Dataset"], "end time": "2019-12-05 23:10:16.263510"}