{"start time": "2019-12-06 00:20:08.432099", "row_count": 3835, "dataset_name": "r67x-e97r.tsv.gz", "columns": [{"column_name": "Submitted Question", "number_non_empty_cells": 3835, "number_empty_cells": 0, "number_distinct_values": 2495, "frequent_values": ["Thank you,", "-NYC Open Data\"", "- NYC Open Data Team\"", "​", "Best,"], "dataTypes": [{"type": "Integer", "count": 13, "max_val": 880929209, "min_val": 4, "mean": 397267725.7692308, "std_dev": 340217209.7149295}, {"type": "Text", "count": 3803, "longest_values": ["There is some merit to this point. Not all datasets published in OpenData come with geospatial information. In fact, not all development teams if any are trained to include exactly what is in LL108. If this was a problem, the Open Data team would have stopped publishing any dataset and required us to make remediation steps before publishing as they are the gatekeepers and we need to adhere to certain standards. Knowing this now, I will know better going forward since we have the capability now as well. To address the present problem specific to this set, it seems clear that the requester is asking for house numbers and street numbers to be split so the dataset can be geocoded either on our side or their side. The desktop geocoder is available for the public from DCP to use, so they would need to run the dataset through that if they wanted everything. Because the law doesn’t say which reference data other than Community District, the vagueness does not help guide us to what else is needed other than having the requester self-service the rest through the desktop geocoder. It not that it isn’t available, it just won’t be easy to get ‘the rest’ of whatever the requester is seeking. So we would need the house number and street name split for us to geocode it and it is work I would assist you putting in an intake to secure this as a project enhancement. This would be the prime opportunity, if you want to proceed, to add more fields that DOI may need (e.g. case type, number of Order to show cause). I would suggest the public request revision of LL108 to be more specific on what kind of geospatial reference data. As far as I know, the address is a valid piece of information that is technically geospatial reference data already without more specifics on the definition. Here’s the actual LL108. https://www1.nyc.gov/assets/buildings/local_laws/ll108of2015.pdf", "\"\"additional_description_1\"\": \"\"<p> \\t<strong>NOTICE OF PUBLIC MEETING </strong></p> <p> \\t<br /> \\tThe City’s Charter Revision Commission will hold a public meeting on Tuesday, June 12, 2018. The issue forum will feature experts to discuss Election Administration, Voter Participation, and Voting Access. The meeting will be held at 125 Worth Street, 2<sup><font size='2'>nd</font></sup> floor Auditorium. This meeting is open to the public. Because this is a public meeting and not a public hearing, the public will have the opportunity to observe the Commission’s discussions, but not testify before it.<br /> \\t<br /> \\t<strong>What if I need assistance to participate in the meeting? </strong>This location is accessible to individuals using wheelchairs or other mobility devices. Induction loop systems and ASL interpreters will be available. In addition, with advance notice, members of the public may request language interpreters. Please make language interpretation requests or additional accessibility requests by 5PM no later than Friday, June 8, 2018 by emailing the Commission at <a>requests@charter.nyc.gov</a>or calling 212-386-5350.</p> <p> \\t </p> <p> \\tA livestream video of this meeting will be available at <a href='https://csmail.nyc.gov/owa/redir.aspx?C=RgTvl5TE6z1apDr7iL78uvPLqm1gDpB4mxaoGgj3lss4h7nwTLvVCA..&URL=http%3a%2f%2fwww1.nyc.gov%2fsite%2fcharter%2fmeetings%2f2018-public-meetings-hearings.page' target='_blank'>nyc.gov/charter</a>.</p> <p> \\t </p>\"\", ", "1. We are interested in de-duplicating the dataset to measure aggregate evictions throughout the five boroughs , and there are a number of observations that have a) identical index & docket numbers or b) identical marshal name, address, date, and unit number. Do either the former or the latter indicate duplicate observations? In the former situation, it would make sense that a unique index & docket combination would refer to a unique eviction, as the index # seems to be a unique ID provided by NY Housing Court, and docket # seems to be a unique ID assigned by the marshal. However, there are cases of duplicate index & docket combination assigned to different eviction addresses, unit #s, etc. In the latter situation, we are not sure whether we can rule out the possibility of these duplicates referring to, for example, same-day evictions in different units in the same building (where a marshal might have just recorded one unit # for ease). Please advise on how we should be thinking of de-duplicating this dataset. ", "​1. We are interested in de-duplicating the dataset to measure aggregate evictions throughout the five boroughs, and there are a number of observations that have a) identical index & docket numbers or b) identical marshal name, address, date, and unit number. Do either the former or the latter indicate duplicate observations? In the former situation, it would make sense that a unique index & docket combination would refer to a unique eviction, as the index # seems to be a unique ID provided by NY Housing Court, and docket # seems to be a unique ID assigned by the marshal. However, there are cases of duplicate index & docket combination assigned to different eviction addresses, unit #s, etc. In the latter situation, we are not sure whether we can rule out the possibility of these duplicates referring to, for example, same-day evictions in different units in the same building (where a marshal might have just recorded one unit # for ease). Please advise on how we should be thinking of de-duplicating this dataset. ", "Hello, I am writing to seek clarification about the 311 service request data set.  Not too long ago, the total number of rows in the '311 Service Requests 2010 to present' data set dropped dramatically from about 17 million to 9 million. Why did this happen and is there any way to access the calls that are now missing? For example, on 8/14/11 this data set used to have record of 691 calls with one of these descriptors: sewer backup, catch basin clogged, street flooding, manhole overflow, highway flooding. Today that same data set with the same filters is showing 44 total calls. I had downloaded this data a few months ago so I have all the records for this day that are missing but as I continue my work I will need to download more of this data and thus need to make sure the calls I am downloading are an accurate depiction of the needs of citizens on a given day. Please let me know why this change was made and if there is any way to recover the records as they appeared before the change. "], "shortest_values": ["\"", "}", "​", "{ ", "}\""], "average_length": 101.72863528793059}, {"type": "Date/Time", "count": 19, "max_value": "2018-04-26 00:00:00", "min_value": "2016-01-05 00:00:00"}]}, {"column_name": "Submitted Dataset URL", "number_non_empty_cells": 710, "number_empty_cells": 3125, "number_distinct_values": 407, "frequent_values": ["None", "https://data.cityofnewyork.us/City-Government/Civil-Service-List-Active-/vx8i-nprf/data", "https://data.cityofnewyork.us/Public-Safety/NYPD-Motor-Vehicle-Collisions/h9gi-nx95", "https://data.cityofnewyork.us/Housing-Development/DOB-Permit-Issuance/ipu4-2q9a/data", "https://data.cityofnewyork.us/Housing-Development/DOB-Permit-Issuance/ipu4-2q9a"], "dataTypes": [{"type": "Text", "count": 3835, "longest_values": ["https://data.cityofnewyork.us/api/id/fhrw-4uyv.csv?$select=*&$order=%27created_date%27+DESC&$limit=40000&$offset=0&$where=(`agency`%20%3D%20%27DOT%27)%20AND%20%60created_date%60%20%3E%3D%20%272019-02-30T00%3A00%3A00%27%20AND%20%60created_date%60%20%3C%20%272019-02-04T23%3A59%3A59%27&$$read_from_nbe=true&$$version=2.1", "https://data.cityofnewyork.us/api/views/a35y-93e7/files/95ea8be1-bac7-47de-a8a7-dadea2866a81?download=true&filename=OCDV_Open_Data_Data_Dictionary_Data_Fam_Rel_Sanp_Shot_Data_2017.xlsx", "I am writing to inform that my residency credit was not applied for the FDNY open competitive exam 7001. I’d like to be advise on how to proceed with this matter.", "https://data.cityofnewyork.us/api/views/y9gu-cxxw/files/c7516c9c-db82-429d-9f69-fb2dc796abc5?download=true&filename=NYCgov_Poverty_Measure_Data_Dictionary.xlsx", "https://data.cityofnewyork.us/NYC-BigApps/Citi-Bike-Live-Station-Feed-JSON-/p94q-8hxh?category=NYC-BigApps&view_name=Citi-Bike-Live-Station-Feed-JSON-"], "shortest_values": ["None", "http://www.fdny.org", "http://www.rumcsi.org", "https://maps.nyc.gov/crime/", "http://TLC LIcesned FHV drivers"], "average_length": 18.828943937418515}]}, {"column_name": "Response", "number_non_empty_cells": 728, "number_empty_cells": 3107, "number_distinct_values": 485, "frequent_values": ["None", "Greetings,", "Hello,", "Thank you for contacting NYC Open Data Help Desk. If you believe that your score on this Exam is incorrect, please follow the instructions on the Notice of Result, which you should be receiving in the mail in about ten days", "Greetings, "], "dataTypes": [{"type": "Text", "count": 3835, "longest_values": ["​Thank you for contacting NYC Open Data Help Desk. Please note that the ​Issue Date column is a text type and sorts the records based on alphanumeric values rather than chronologically. The text data type was chosen for the column specifically to allow the records that contain date errors entered by the officers (such as April 31 and other illegal values) to be added to the dataset that otherwise would be omitted due to a data type mismatch. You are encouraged to utilize a filter feature using the underlying dataset https://data.cityofnewyork.us/City-Government/Open-Parking-and-Camera-Violations/nc67-uf89 to search for the records based on specified criteria. For more information on how to use this feature, please visit https://support.socrata.com/hc/en-us/articles/202950808-Creating-a-Filtered-View", "\"Thank you for contacting NYC Open Data Help Desk. To view ES overlay, please select \"\"View as a table\"\" option and choose ES_Zones_2017_2018_v21WC layer from the list. For more information on how to use this Socrata feature, please refer to https://support.socrata.com/hc/en-us/articles/202949858-View-data-as-a-table-rich-list-or-single-row                                                                                                                                                                                                                                                                         This dataset contains geospatial information pertaining to the school zones only, and does not have a functionality to lookup a specific address information.\"", "\"Thank you for contacting NYC Open Data Help Desk. Please note that there are no technical issues with the Legally Operating Businesses dataset itself. The \"\"Address ZIP\"\" column does contain over 500 records with no value assigned or zero values, but it is data related, not a technical error. It might be helpful to note that \"\"Address ZIP\"\" is a text-type column, not a numeric type. In addition, some of the zipcode values have a leading zero and might require special handling. Since you are using a third-party tool, you are encouraged to refer to your program's documentation to resolve this issue.", "Thank you for contacting NYC Open Data Help Desk. Please note that 96% of the violations missing an NOV Issue Date at the time this dataset was pulled are “Class I” violations. Class I violations are not truly violations, they are informational notices that according to this dataset's data dictionary, “...do not have certification periods associated; they indicate something about the status of the property: that an order is open against the property or that a property is vacant or that a properly is not validly registered.” Which explains why certification-related information is missing.", "The data in the Yellow Trip Record dataset were collected and provided to the NYC Taxi and Limousine Commission (TLC) by technology providers authorized under the Taxicab & Livery Passenger Enhancement Programs (TPEP/LPEP). The trip data was not created by the TLC, and TLC does not modify the data we were provided. We have uploaded records through June 30, 2018-- anything after this date was recorded in error. We are currently working on releasing trip records to Open Data and the TLC website through the end of the 2018-- please check back in a week or so for updated data."], "shortest_values": ["\"", "​", "Hi,", "Hi ,", "Hi, "], "average_length": 31.25058670143416}]}], "col_count": 4, "key_column_candidates": ["Submitted Question"], "end time": "2019-12-06 00:20:10.155240"}