{"start time": "2019-12-06 00:25:37.770520", "row_count": 1882, "dataset_name": "rukc-mmqu.tsv.gz", "columns": [{"column_name": "Project ID", "number_non_empty_cells": 1882, "number_empty_cells": 0, "number_distinct_values": 1819, "frequent_values": ["Any upgrades to the ramps must also rehabilitate the receiving corner where possible. Any deviation will require DOT's approval. This contract will be addressing simple pedestrian ramps upgrades.\"", "WM-1 in:", "Water Main in:", "H.L.S.S. in:", "Sanitary Sewer in:"], "dataTypes": [{"type": "Real", "count": 20, "max_val": 35.0, "min_val": 1.0, "mean": 18.4, "std_dev": 11.833938704554706}, {"type": "Text", "count": 1861, "longest_values": ["The capital project focuses on the 7.5-mile portion of the entire SBS corridor along Kings Highway (Segment K), Flatlands Avenue (Segment F), and Pennsylvania Avenue (Segment P). Along these three corridors, the capital project will build a combination of new bus lanes with high-quality bus stations and signal timing changes, as well as safety improvements for bus passengers, pedestrians, and all street users. Bus stops will be rehabilitated with expanded ADA-accessible platforms, bus shelters, lighting, and seating. Concrete curb extensions and central medians will be built to reduce crossing distances. Additionally, all the medians along Kings Highway will be reconstructed in a state of good repair along with the bus stops.\"", "The project will provide safer access to parks and recreational spaces along the waterfront, encourage healthy lifestyles by promoting the use of non-motorized forms of transportation, and stimulate economic development by providing connections to employment centers in the Sunset Park, Gowanus, Red Hook and Downtown Brooklyn neighborhoods. The project will bring the streets to a state of good repair and incorporate any necessary hazard mitigation measures into the design (including green infrastructure and infrastructure hardening) to provide long-term climate resiliency. Additional improvements such a concrete curb extensions will shorten crossing distances to enhance pedestrian safety at key intersections. ", "The scope includes: Reconstruct pedestrian plaza with resting/sitting area, walkways/sidewalks and landscaping (grass/planting spaces), drinking fountain, & refurbishing of war memorial. The scope of work also involves the reconstruction and re-configuration of Zion Triangle bounded by Pitkin Ave, East NY Ave, and Legion St, expanding the public space into East New York Ave by approximately 6 feet, plus 10' width roadways (around the public plaza) including all related works (street lighting, traffic signals & marking, catch basin installation); build ADA ramps and sidewalk. Legion Street will be closed to vehicular traffic and incorporate that street into the enhanced public space.", "A total of $10,411,000 is funded for this project. The project will be funded with FEMA and HUD CDBG-DR funding. The FEMA grant is currently approved under Pre-Award Authorization. FEMA grants have not yet reached obligation but require 10% local (Mayoral) matching funds. Federal funds (FEMA) may be used for final design, construction and supervision. $800,000 is funded in FY18 for design, $8,021,000 in FY19 for construction, and $1,590,000 in FY19 for REI. Please see the enclosed CPI for additional details.\"", "Resurfacing: Abbey Court from Bartlett Place to Dead End, Cyrus Avenue from Just Court to Gerritsen Avenue, three sections of Madoc Avenue (from Cyrus Avenue to Lester Court, from Melba Court to Nova Court, from Post Court to Dead End), Noel Avenue from Cyrus Avenue to Lois Avenue and Seba Avenue from Madoc Avenue to Gerritsen Avenue, Channel Ave between Celeste Court and Bevy Court , Channel Ave between Aster Court and Gerritsen Ave .\""], "shortest_values": ["-", ".\"", "1) ", "2) ", "3) "], "average_length": 43.39226222461043}, {"type": "Date/Time", "count": 1, "max_value": "0208-12-06 00:00:00", "min_value": "0208-12-06 00:00:00"}]}, {"column_name": "Description", "number_non_empty_cells": 607, "number_empty_cells": 1275, "number_distinct_values": 461, "frequent_values": ["None", "5M+", "1M-5M", "REHABILITATION OF PEDESTRIAN RAMPS", "NEIGHBORHOOD STORM SEWER EXTENSIONS"], "dataTypes": [{"type": "Text", "count": 1875, "longest_values": ["The project is in the vicinity of NYCT subway line on Broadway and as such will need a Force Account and NYCT approved plans.\"", "The project is located in a historic district and will need to be coordinated with LPC,", "14th  Avenue between Beach Street and College Point Blvd;", "14th Avenue between I 24th Street and College Point Blvd;", "!21st  Street between 18th Avenue and 22\"\"d Avenue;"], "shortest_values": ["5M+", "None", "0-500k", "BOGARDUS PLAZA", "East River Park"], "average_length": 13.678933333333333}, {"type": "Date/Time", "count": 7, "max_value": "2019-12-06 00:05:00", "min_value": "2019-12-06 00:05:00"}]}, {"column_name": "Client Agency", "number_non_empty_cells": 581, "number_empty_cells": 1301, "number_distinct_values": 13, "frequent_values": ["None", "Environmental Protection", "Transportation", "Active", "Education"], "dataTypes": [{"type": "Text", "count": 1882, "longest_values": ["Environmental Protection", "Trans. & Env. Protection", "Emergency Management", "Parks & Recreation", "Transportation"], "shortest_values": ["-", "5M+", "HPD", "DCAS", "None"], "average_length": 7.772051009564294}]}, {"column_name": "Division", "number_non_empty_cells": 468, "number_empty_cells": 1414, "number_distinct_values": 3, "frequent_values": ["None", "Infrastructure", "Active"], "dataTypes": [{"type": "Text", "count": 1882, "longest_values": ["Infrastructure", "Active", "None"], "shortest_values": ["None", "Active", "Infrastructure"], "average_length": 6.482465462274177}]}, {"column_name": "Phase", "number_non_empty_cells": 467, "number_empty_cells": 1415, "number_distinct_values": 9, "frequent_values": ["None", "Construction", "Design", "Procurement", "Development"], "dataTypes": [{"type": "Text", "count": 1882, "longest_values": ["Construction", "Development", "Procurement", "Initiation", "Closeout"], "shortest_values": ["-", "FEP", "None", "Design", "Closeout"], "average_length": 5.3554729011689695}]}, {"column_name": "Projected Construction Completion ", "number_non_empty_cells": 427, "number_empty_cells": 1455, "number_distinct_values": 331, "frequent_values": ["None", "07/29/2021", "03/23/2020", "09/13/2024", "06/30/2021"], "dataTypes": [{"type": "Text", "count": 1455, "longest_values": ["None"], "shortest_values": ["None"], "average_length": 4.0}, {"type": "Date/Time", "count": 427, "max_value": "2031-09-28 00:00:00", "min_value": "2017-07-31 00:00:00"}]}, {"column_name": "Scope", "number_non_empty_cells": 467, "number_empty_cells": 1415, "number_distinct_values": 431, "frequent_values": ["None", "REHABILITATION (REPAIR AND UPGRADE TO ADA SPECIFICATIONS TO THE MAXIMUM EXTENT FEASIBLE) OF EXISTING PEDESTRIAN RAMPS IN THE BOROUGH OF BROOKLYN. THE LIST OF LOCATIONS FOR THIS CONTRACT WILL BE PROVIDED BY SIM AT A LATER DATE. THE PED RAMP REPAIRS WILL FOLLOW RESURFACING SCHEDULES. ANY UPGRADES TO THE RAMPS MUST ALSO REHABILITATE THE RECEIVING CORNER WHERE POSSIBLE. ANY DEVIATION WILL REQUIRE DOT'S APPROVAL. THIS CONTRACT WILL BE ADDRESSING SIMPLE PED RAMP UPGRADES. THIS CONTRACT WILL BE ESTABLISHED FOR 1 YEAR AND MAY ONLY BE RENEWED IF A TIME EXTENSION IS NEEDED. ALL THE PROJECT FUNDS MUST BE REGISTERED IN THE 1ST YEAR.", "INSTALLATION OF MODULAR STRUCTURES, QUEENS", "REPLACEMENT/REPAIR IN KIND OF MANHOLE HARDWARE (INCLUDING CASTINGS AND CHIMNEY ADJUSTMENTS).  NO RINGS SHALL BE ALLOWED.", "GI - DSGN & CONST OF BIOSWALES & GREENSTREETS, QUEENS"], "dataTypes": [{"type": "Text", "count": 1882, "longest_values": ["This project will construct approximately 12 blocks of the 14-mile Brooklyn Waterfront Greenway. This project establishes the southernmost leg of the Greenway, linking the neighborhoods of Sunset Park and Bay Ridge, where the Greenway will ultimately connect to the Shore Parkway Esplanade. The project will provide safer access to parks and recreational spaces along the waterfront, encourage healthy lifestyles by promoting the use of non-motorized forms of transportation, improve sustainability by capturing storm water, and stimulate economic development by providing connections to employment centers in Downtown Brooklyn and the Sunset Park, Gowanus, and Red Hook neighborhoods. The projects limits include 2nd Avenue from 58th Street to Wakeman Place and Wakeman Place from Ridge Boulevard to Colonial Road. These streets will be reconfigured in order to provide space for the two-way, grade-separated greenway path as well as additional planted areas. This project also includes the rehabilitation (25% replacement & 75% repair) of a retaining wall along the northwest side of 2nd Avenue and between 58th & 65th Streets.", "THIS PROJECT IS LOCATED IN THE BROWNSVILLE NEIGHBORHOOD OF EAST BROOKLYN AND IS BOUNDED BY SUTTER AVE, JUNIUS STREET, LIVONIA AVE AND ROCKAWAY AVE.  THIS AREA IS A NYC DOT TOP PRIORITY OF SAFETY IMPROVEMENTS AND RANKS IN THE TOP THIRD OF BROOKLYN CORRIDORS. IT HAS A RATE OF 11.2 KSI PER MILES WITH 2 PEDESTRIAN AND BICYCLIST FATALITIES SINCE 2010.  THIS PROJECT CONSISTS OF THE INSTALLATION OF 13 CURB EXTENSIONS, 1 SIDEWALK EXTENSION, 1 BUS BULB AND BUS PAD, 2 RAISED CROSSWALKS AND 2 MEDIAN RECONSTRUCTION.  THE PURPOSE OF THIS PROJECT IS TO CALM TRAFFIC, PROVIDE SAFER PEDESTRIAN CROSSINGS AND IMPROVE THE PUBLIC REALM IN A MAINLY RESIDENTIAL NEIGHBORHOOD.  THE CURB EXTENSION WILL SHORTEN CROSSING DISTANCE FOR PEDESTRIANS AND REDUCE THE SPEED OF VEHICLES APPROACHING AND TURNING ON SCHOOL CROSSWALKS.", "Putnam Plaza is an existing plaza implemented in temporary materials that also includes an existing Department of Parks and Recreation (DPR) Green street triangle with trees and a landscape area. This project will create a large, permanent public space for the Clinton Hill and Bedford-Stuyvesant neighborhoods by permanently pedestrianizing Putnam Avenue from Grand Avenue to Fulton Street, increasing the amount of open space for the local residents, shoppers, and transit users. The design will incorporate the existing Green street and will likely include additional trees, benches, movable tables and chairs, trash receptacles, green infrastructure elements, pedestrian Wayfinding signage and an NYC Bike Share station.", "THE SCOPE OF WORK INCLUDES MANAGEMENT OF TOTAL DESIGN, PROCUREMENT AND CONSTRUCTION OF PEDESTRIAN SAFETY IMPROVEMENTS AT THE FOLLOWING SIX SCHOOLS IN MANHATTAN: PS92-MARY MCLEOD BETHUNE,  JHS275/IS 275-MIDDLE SCHOOL FOR MARKETING & LEGAL, PS 83-LUIS MUNOZ RIVERA SCHOOL, NEW DESIGN MIDDLE & KIPP INFINITY CHARTER SCHOOL, PS 153, AND PS 128-AUDUBON SCHOOL.  THE PROPOSED SCOPE OF IMPROVEMENTS MAINLY INCLUDES MEDIAN TIP EXTENSIONS, CURB EXTENSIONS, AND PEDESTRIAN SAFETY ISLANDS. EACH SCHOOL SHOULD HAVE ITS OWN BID ITEMS ALONG WITH THE TOTAL COST.  TRAFFIC ANALYSIS INCLUDING AUTO TURN ANALYSIS WITH SCHOOL BUS, CITY BUS, TRUCK AND FDNY VEHICLES MUST BE CONDUCTED. PEDESTRIAN RAMPS MUST COMPLY WITH ADA STANDARDS.", "REHABILITATION (REPAIR AND UPGRADE TO ADA SPECIFICATIONS TO THE MAXIMUM EXTENT FEASIBLE) OF EXISTING PEDESTRIAN RAMPS IN THE BOROUGH OF BROOKLYN. THE LIST OF LOCATIONS FOR THIS CONTRACT WILL BE PROVIDED BY SIM AT A LATER DATE. THE PED RAMP REPAIRS WILL FOLLOW RESURFACING SCHEDULES. ANY UPGRADES TO THE RAMPS MUST ALSO REHABILITATE THE RECEIVING CORNER WHERE POSSIBLE. ANY DEVIATION WILL REQUIRE DOT'S APPROVAL. THIS CONTRACT WILL BE ADDRESSING SIMPLE PED RAMP UPGRADES. THIS CONTRACT WILL BE ESTABLISHED FOR 1 YEAR AND MAY ONLY BE RENEWED IF A TIME EXTENSION IS NEEDED. ALL THE PROJECT FUNDS MUST BE REGISTERED IN THE 1ST YEAR."], "shortest_values": ["None", "STORM SEWER:", "REVISED to:   ", "Storm sewer in:", "Replacement of :"], "average_length": 34.06482465462274}]}, {"column_name": "Dollar Amount", "number_non_empty_cells": 353, "number_empty_cells": 1529, "number_distinct_values": 5, "frequent_values": ["None", "5M+", "0-500k", "1M-5M", "501k-1M"], "dataTypes": [{"type": "Text", "count": 1834, "longest_values": ["501k-1M", "0-500k", "None", "5M+"], "shortest_values": ["5M+", "None", "0-500k", "501k-1M"], "average_length": 3.9340239912759}, {"type": "Date/Time", "count": 48, "max_value": "2019-12-06 00:05:00", "min_value": "2019-12-06 00:05:00"}]}, {"column_name": "Status", "number_non_empty_cells": 353, "number_empty_cells": 1529, "number_distinct_values": 2, "frequent_values": ["None", "Active"], "dataTypes": [{"type": "Text", "count": 1882, "longest_values": ["Active", "None"], "shortest_values": ["None", "Active"], "average_length": 4.375132837407014}]}], "col_count": 10, "key_column_candidates": ["Project ID"], "end time": "2019-12-06 00:25:39.785905"}